; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_3)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 - boat
		p0 p1 p2 - person
	)

  (:init
		(= (x b0) -8)
(= (y b0) 0)
(= (x b1) 1)
(= (y b1) 0)
(= (x b2) -7)
(= (y b2) 0)
(= (x b3) 4)
(= (y b3) 0)
(= (x b4) 6)
(= (y b4) 0)
(= (x b5) 10)
(= (y b5) 0)
(= (x b6) -6)
(= (y b6) 0)
(= (x b7) -10)
(= (y b7) 0)
(= (x b8) -8)
(= (y b8) 0)

		(= (d p0) 326)
(= (d p1) 187)
(= (d p2) 121)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
		)
	)
)

; plan
1. (go_north_east b1)
   changed: (x b1) from 1 to 2.5, (y b1) from 0 to 1.5
   goals met: 0 of 3
2. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 1.5 to 3
   goals met: 0 of 3
3. (go_north_east b1)
   changed: (x b1) from 4 to 5.5, (y b1) from 3 to 4.5
   goals met: 0 of 3
4. (go_north_east b1)
   changed: (x b1) from 5.5 to 7, (y b1) from 4.5 to 6
   goals met: 0 of 3
5. (go_north_east b1)
   changed: (x b1) from 7 to 8.5, (y b1) from 6 to 7.5
   goals met: 0 of 3
6. (go_north_east b1)
   changed: (x b1) from 8.5 to 10, (y b1) from 7.5 to 9
   goals met: 0 of 3
7. (go_north_east b1)
   changed: (x b1) from 10 to 11.5, (y b1) from 9 to 10.5
   goals met: 0 of 3
8. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 10.5 to 12
   goals met: 0 of 3
9. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 12 to 13.5
   goals met: 0 of 3
10. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 13.5 to 15
   goals met: 0 of 3
11. (go_north_east b1)
   changed: (x b1) from 16 to 17.5, (y b1) from 15 to 16.5
   goals met: 0 of 3
12. (go_north_east b1)
   changed: (x b1) from 17.5 to 19, (y b1) from 16.5 to 18
   goals met: 0 of 3
13. (go_north_east b1)
   changed: (x b1) from 19 to 20.5, (y b1) from 18 to 19.5
   goals met: 0 of 3
14. (go_north_east b1)
   changed: (x b1) from 20.5 to 22, (y b1) from 19.5 to 21
   goals met: 0 of 3
15. (go_north_east b1)
   changed: (x b1) from 22 to 23.5, (y b1) from 21 to 22.5
   goals met: 0 of 3
16. (go_north_east b1)
   changed: (x b1) from 23.5 to 25, (y b1) from 22.5 to 24
   goals met: 0 of 3
17. (go_north_east b1)
   changed: (x b1) from 25 to 26.5, (y b1) from 24 to 25.5
   goals met: 0 of 3
18. (go_north_east b1)
   changed: (x b1) from 26.5 to 28, (y b1) from 25.5 to 27
   goals met: 0 of 3
19. (go_north_east b1)
   changed: (x b1) from 28 to 29.5, (y b1) from 27 to 28.5
   goals met: 0 of 3
20. (go_north_east b1)
   changed: (x b1) from 29.5 to 31, (y b1) from 28.5 to 30
   goals met: 0 of 3
21. (go_north_east b1)
   changed: (x b1) from 31 to 32.5, (y b1) from 30 to 31.5
   goals met: 0 of 3
22. (go_north_east b1)
   changed: (x b1) from 32.5 to 34, (y b1) from 31.5 to 33
   goals met: 0 of 3
23. (go_north_east b1)
   changed: (x b1) from 34 to 35.5, (y b1) from 33 to 34.5
   goals met: 0 of 3
24. (go_north_east b1)
   changed: (x b1) from 35.5 to 37, (y b1) from 34.5 to 36
   goals met: 0 of 3
25. (go_north_east b1)
   changed: (x b1) from 37 to 38.5, (y b1) from 36 to 37.5
   goals met: 0 of 3
26. (go_north_east b1)
   changed: (x b1) from 38.5 to 40, (y b1) from 37.5 to 39
   goals met: 0 of 3
27. (go_north_east b1)
   changed: (x b1) from 40 to 41.5, (y b1) from 39 to 40.5
   goals met: 0 of 3
28. (go_north_east b1)
   changed: (x b1) from 41.5 to 43, (y b1) from 40.5 to 42
   goals met: 0 of 3
29. (go_north_east b1)
   changed: (x b1) from 43 to 44.5, (y b1) from 42 to 43.5
   goals met: 0 of 3
30. (go_north_east b1)
   changed: (x b1) from 44.5 to 46, (y b1) from 43.5 to 45
   goals met: 0 of 3
31. (go_north_east b1)
   changed: (x b1) from 46 to 47.5, (y b1) from 45 to 46.5
   goals met: 0 of 3
32. (go_north_east b1)
   changed: (x b1) from 47.5 to 49, (y b1) from 46.5 to 48
   goals met: 0 of 3
33. (go_north_east b1)
   changed: (x b1) from 49 to 50.5, (y b1) from 48 to 49.5
   goals met: 0 of 3
34. (go_north_east b1)
   changed: (x b1) from 50.5 to 52, (y b1) from 49.5 to 51
   goals met: 0 of 3
35. (go_north_east b1)
   changed: (x b1) from 52 to 53.5, (y b1) from 51 to 52.5
   goals met: 0 of 3
36. (go_north_east b1)
   changed: (x b1) from 53.5 to 55, (y b1) from 52.5 to 54
   goals met: 0 of 3
37. (go_north_east b1)
   changed: (x b1) from 55 to 56.5, (y b1) from 54 to 55.5
   goals met: 0 of 3
38. (go_north_east b1)
   changed: (x b1) from 56.5 to 58, (y b1) from 55.5 to 57
   goals met: 0 of 3
39. (go_north_east b1)
   changed: (x b1) from 58 to 59.5, (y b1) from 57 to 58.5
   goals met: 0 of 3
40. (go_north_east b1)
   changed: (x b1) from 59.5 to 61, (y b1) from 58.5 to 60
   goals met: 0 of 3
41. (go_north_east b1)
   changed: (x b1) from 61 to 62.5, (y b1) from 60 to 61.5
   goals met: 0 of 3
42. (go_north_east b1)
   changed: (x b1) from 62.5 to 64, (y b1) from 61.5 to 63
   goals met: 0 of 3
43. (go_north_east b1)
   changed: (x b1) from 64 to 65.5, (y b1) from 63 to 64.5
   goals met: 0 of 3
44. (go_north_east b1)
   changed: (x b1) from 65.5 to 67, (y b1) from 64.5 to 66
   goals met: 0 of 3
45. (go_north_east b1)
   changed: (x b1) from 67 to 68.5, (y b1) from 66 to 67.5
   goals met: 0 of 3
46. (go_north_east b1)
   changed: (x b1) from 68.5 to 70, (y b1) from 67.5 to 69
   goals met: 0 of 3
47. (go_north_east b1)
   changed: (x b1) from 70 to 71.5, (y b1) from 69 to 70.5
   goals met: 0 of 3
48. (go_north_east b1)
   changed: (x b1) from 71.5 to 73, (y b1) from 70.5 to 72
   goals met: 0 of 3
49. (go_north_west b1)
   changed: (x b1) from 73 to 71.5, (y b1) from 72 to 73.5
   goals met: 0 of 3
50. (go_north_west b1)
   changed: (x b1) from 71.5 to 70, (y b1) from 73.5 to 75
   goals met: 0 of 3
51. (go_north_west b1)
   changed: (x b1) from 70 to 68.5, (y b1) from 75 to 76.5
   goals met: 0 of 3
52. (go_north_west b1)
   changed: (x b1) from 68.5 to 67, (y b1) from 76.5 to 78
   goals met: 0 of 3
53. (go_north_west b1)
   changed: (x b1) from 67 to 65.5, (y b1) from 78 to 79.5
   goals met: 0 of 3
54. (go_north_west b1)
   changed: (x b1) from 65.5 to 64, (y b1) from 79.5 to 81
   goals met: 0 of 3
55. (go_north_west b1)
   changed: (x b1) from 64 to 62.5, (y b1) from 81 to 82.5
   goals met: 0 of 3
56. (go_north_west b1)
   changed: (x b1) from 62.5 to 61, (y b1) from 82.5 to 84
   goals met: 0 of 3
57. (go_north_west b1)
   changed: (x b1) from 61 to 59.5, (y b1) from 84 to 85.5
   goals met: 0 of 3
58. (go_north_west b1)
   changed: (x b1) from 59.5 to 58, (y b1) from 85.5 to 87
   goals met: 0 of 3
59. (go_north_west b1)
   changed: (x b1) from 58 to 56.5, (y b1) from 87 to 88.5
   goals met: 0 of 3
60. (go_north_west b1)
   changed: (x b1) from 56.5 to 55, (y b1) from 88.5 to 90
   goals met: 0 of 3
61. (go_north_west b1)
   changed: (x b1) from 55 to 53.5, (y b1) from 90 to 91.5
   goals met: 0 of 3
62. (go_north_west b1)
   changed: (x b1) from 53.5 to 52, (y b1) from 91.5 to 93
   goals met: 0 of 3
63. (go_north_west b1)
   changed: (x b1) from 52 to 50.5, (y b1) from 93 to 94.5
   goals met: 0 of 3
64. (go_north_west b1)
   changed: (x b1) from 50.5 to 49, (y b1) from 94.5 to 96
   goals met: 0 of 3
65. (go_north_west b1)
   changed: (x b1) from 49 to 47.5, (y b1) from 96 to 97.5
   goals met: 0 of 3
66. (go_north_west b1)
   changed: (x b1) from 47.5 to 46, (y b1) from 97.5 to 99
   goals met: 0 of 3
67. (go_north_west b1)
   changed: (x b1) from 46 to 44.5, (y b1) from 99 to 100.5
   goals met: 0 of 3
68. (go_north_west b1)
   changed: (x b1) from 44.5 to 43, (y b1) from 100.5 to 102
   goals met: 0 of 3
69. (go_north_west b1)
   changed: (x b1) from 43 to 41.5, (y b1) from 102 to 103.5
   goals met: 0 of 3
70. (go_north_west b1)
   changed: (x b1) from 41.5 to 40, (y b1) from 103.5 to 105
   goals met: 0 of 3
71. (go_north_west b1)
   changed: (x b1) from 40 to 38.5, (y b1) from 105 to 106.5
   goals met: 0 of 3
72. (go_north_west b1)
   changed: (x b1) from 38.5 to 37, (y b1) from 106.5 to 108
   goals met: 0 of 3
73. (go_north_west b1)
   changed: (x b1) from 37 to 35.5, (y b1) from 108 to 109.5
   goals met: 0 of 3
74. (go_north_west b1)
   changed: (x b1) from 35.5 to 34, (y b1) from 109.5 to 111
   goals met: 0 of 3
75. (go_north_west b1)
   changed: (x b1) from 34 to 32.5, (y b1) from 111 to 112.5
   goals met: 0 of 3
76. (go_north_west b1)
   changed: (x b1) from 32.5 to 31, (y b1) from 112.5 to 114
   goals met: 0 of 3
77. (go_north_west b1)
   changed: (x b1) from 31 to 29.5, (y b1) from 114 to 115.5
   goals met: 0 of 3
78. (go_north_west b1)
   changed: (x b1) from 29.5 to 28, (y b1) from 115.5 to 117
   goals met: 0 of 3
79. (go_north_west b1)
   changed: (x b1) from 28 to 26.5, (y b1) from 117 to 118.5
   goals met: 0 of 3
80. (go_north_west b1)
   changed: (x b1) from 26.5 to 25, (y b1) from 118.5 to 120
   goals met: 0 of 3
81. (go_north_west b1)
   changed: (x b1) from 25 to 23.5, (y b1) from 120 to 121.5
   goals met: 0 of 3
82. (go_north_west b1)
   changed: (x b1) from 23.5 to 22, (y b1) from 121.5 to 123
   goals met: 0 of 3
83. (go_north_west b1)
   changed: (x b1) from 22 to 20.5, (y b1) from 123 to 124.5
   goals met: 0 of 3
84. (go_north_west b1)
   changed: (x b1) from 20.5 to 19, (y b1) from 124.5 to 126
   goals met: 0 of 3
85. (go_north_west b1)
   changed: (x b1) from 19 to 17.5, (y b1) from 126 to 127.5
   goals met: 0 of 3
86. (go_north_west b1)
   changed: (x b1) from 17.5 to 16, (y b1) from 127.5 to 129
   goals met: 0 of 3
87. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 129 to 130.5
   goals met: 0 of 3
88. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 130.5 to 132
   goals met: 0 of 3
89. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 132 to 133.5
   goals met: 0 of 3
90. (save_person b1 p2)
   added: (saved p2)
   goals met: 1 of 3
91. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 133.5 to 135
   goals met: 1 of 3
92. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 135 to 136.5
   goals met: 1 of 3
93. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 136.5 to 138
   goals met: 1 of 3
94. (go_north_east b1)
   changed: (x b1) from 16 to 17.5, (y b1) from 138 to 139.5
   goals met: 1 of 3
95. (go_north_east b1)
   changed: (x b1) from 17.5 to 19, (y b1) from 139.5 to 141
   goals met: 1 of 3
96. (go_north_east b1)
   changed: (x b1) from 19 to 20.5, (y b1) from 141 to 142.5
   goals met: 1 of 3
97. (go_north_east b1)
   changed: (x b1) from 20.5 to 22, (y b1) from 142.5 to 144
   goals met: 1 of 3
98. (go_north_east b1)
   changed: (x b1) from 22 to 23.5, (y b1) from 144 to 145.5
   goals met: 1 of 3
99. (go_north_east b1)
   changed: (x b1) from 23.5 to 25, (y b1) from 145.5 to 147
   goals met: 1 of 3
100. (go_north_east b1)
   changed: (x b1) from 25 to 26.5, (y b1) from 147 to 148.5
   goals met: 1 of 3
101. (go_north_east b1)
   changed: (x b1) from 26.5 to 28, (y b1) from 148.5 to 150
   goals met: 1 of 3
102. (go_north_east b1)
   changed: (x b1) from 28 to 29.5, (y b1) from 150 to 151.5
   goals met: 1 of 3
103. (go_north_east b1)
   changed: (x b1) from 29.5 to 31, (y b1) from 151.5 to 153
   goals met: 1 of 3
104. (go_north_east b1)
   changed: (x b1) from 31 to 32.5, (y b1) from 153 to 154.5
   goals met: 1 of 3
105. (go_north_east b1)
   changed: (x b1) from 32.5 to 34, (y b1) from 154.5 to 156
   goals met: 1 of 3
106. (go_north_east b1)
   changed: (x b1) from 34 to 35.5, (y b1) from 156 to 157.5
   goals met: 1 of 3
107. (go_north_east b1)
   changed: (x b1) from 35.5 to 37, (y b1) from 157.5 to 159
   goals met: 1 of 3
108. (go_north_east b1)
   changed: (x b1) from 37 to 38.5, (y b1) from 159 to 160.5
   goals met: 1 of 3
109. (go_north_east b1)
   changed: (x b1) from 38.5 to 40, (y b1) from 160.5 to 162
   goals met: 1 of 3
110. (go_north_east b1)
   changed: (x b1) from 40 to 41.5, (y b1) from 162 to 163.5
   goals met: 1 of 3
111. (go_north_east b1)
   changed: (x b1) from 41.5 to 43, (y b1) from 163.5 to 165
   goals met: 1 of 3
112. (go_north_east b1)
   changed: (x b1) from 43 to 44.5, (y b1) from 165 to 166.5
   goals met: 1 of 3
113. (go_north_west b1)
   changed: (x b1) from 44.5 to 43, (y b1) from 166.5 to 168
   goals met: 1 of 3
114. (go_north_west b1)
   changed: (x b1) from 43 to 41.5, (y b1) from 168 to 169.5
   goals met: 1 of 3
115. (go_north_west b1)
   changed: (x b1) from 41.5 to 40, (y b1) from 169.5 to 171
   goals met: 1 of 3
116. (go_north_west b1)
   changed: (x b1) from 40 to 38.5, (y b1) from 171 to 172.5
   goals met: 1 of 3
117. (go_north_west b1)
   changed: (x b1) from 38.5 to 37, (y b1) from 172.5 to 174
   goals met: 1 of 3
118. (go_north_west b1)
   changed: (x b1) from 37 to 35.5, (y b1) from 174 to 175.5
   goals met: 1 of 3
119. (go_north_west b1)
   changed: (x b1) from 35.5 to 34, (y b1) from 175.5 to 177
   goals met: 1 of 3
120. (go_north_west b1)
   changed: (x b1) from 34 to 32.5, (y b1) from 177 to 178.5
   goals met: 1 of 3
121. (go_north_west b1)
   changed: (x b1) from 32.5 to 31, (y b1) from 178.5 to 180
   goals met: 1 of 3
122. (go_north_west b1)
   changed: (x b1) from 31 to 29.5, (y b1) from 180 to 181.5
   goals met: 1 of 3
123. (go_north_west b1)
   changed: (x b1) from 29.5 to 28, (y b1) from 181.5 to 183
   goals met: 1 of 3
124. (go_north_west b1)
   changed: (x b1) from 28 to 26.5, (y b1) from 183 to 184.5
   goals met: 1 of 3
125. (go_north_west b1)
   changed: (x b1) from 26.5 to 25, (y b1) from 184.5 to 186
   goals met: 1 of 3
126. (go_north_west b1)
   changed: (x b1) from 25 to 23.5, (y b1) from 186 to 187.5
   goals met: 1 of 3
127. (go_north_west b1)
   changed: (x b1) from 23.5 to 22, (y b1) from 187.5 to 189
   goals met: 1 of 3
128. (go_north_west b1)
   changed: (x b1) from 22 to 20.5, (y b1) from 189 to 190.5
   goals met: 1 of 3
129. (go_north_west b1)
   changed: (x b1) from 20.5 to 19, (y b1) from 190.5 to 192
   goals met: 1 of 3
130. (go_north_west b1)
   changed: (x b1) from 19 to 17.5, (y b1) from 192 to 193.5
   goals met: 1 of 3
131. (go_north_west b1)
   changed: (x b1) from 17.5 to 16, (y b1) from 193.5 to 195
   goals met: 1 of 3
132. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 195 to 196.5
   goals met: 1 of 3
133. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 196.5 to 198
   goals met: 1 of 3
134. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 198 to 199.5
   goals met: 1 of 3
135. (save_person b1 p1)
   added: (saved p1)
   goals met: 2 of 3
136. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 199.5 to 201
   goals met: 2 of 3
137. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 201 to 202.5
   goals met: 2 of 3
138. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 202.5 to 204
   goals met: 2 of 3
139. (go_north_east b1)
   changed: (x b1) from 16 to 17.5, (y b1) from 204 to 205.5
   goals met: 2 of 3
140. (go_north_east b1)
   changed: (x b1) from 17.5 to 19, (y b1) from 205.5 to 207
   goals met: 2 of 3
141. (go_north_east b1)
   changed: (x b1) from 19 to 20.5, (y b1) from 207 to 208.5
   goals met: 2 of 3
142. (go_north_east b1)
   changed: (x b1) from 20.5 to 22, (y b1) from 208.5 to 210
   goals met: 2 of 3
143. (go_north_east b1)
   changed: (x b1) from 22 to 23.5, (y b1) from 210 to 211.5
   goals met: 2 of 3
144. (go_north_east b1)
   changed: (x b1) from 23.5 to 25, (y b1) from 211.5 to 213
   goals met: 2 of 3
145. (go_north_east b1)
   changed: (x b1) from 25 to 26.5, (y b1) from 213 to 214.5
   goals met: 2 of 3
146. (go_north_east b1)
   changed: (x b1) from 26.5 to 28, (y b1) from 214.5 to 216
   goals met: 2 of 3
147. (go_north_east b1)
   changed: (x b1) from 28 to 29.5, (y b1) from 216 to 217.5
   goals met: 2 of 3
148. (go_north_east b1)
   changed: (x b1) from 29.5 to 31, (y b1) from 217.5 to 219
   goals met: 2 of 3
149. (go_north_east b1)
   changed: (x b1) from 31 to 32.5, (y b1) from 219 to 220.5
   goals met: 2 of 3
150. (go_north_east b1)
   changed: (x b1) from 32.5 to 34, (y b1) from 220.5 to 222
   goals met: 2 of 3
151. (go_north_east b1)
   changed: (x b1) from 34 to 35.5, (y b1) from 222 to 223.5
   goals met: 2 of 3
152. (go_north_east b1)
   changed: (x b1) from 35.5 to 37, (y b1) from 223.5 to 225
   goals met: 2 of 3
153. (go_north_east b1)
   changed: (x b1) from 37 to 38.5, (y b1) from 225 to 226.5
   goals met: 2 of 3
154. (go_north_east b1)
   changed: (x b1) from 38.5 to 40, (y b1) from 226.5 to 228
   goals met: 2 of 3
155. (go_north_east b1)
   changed: (x b1) from 40 to 41.5, (y b1) from 228 to 229.5
   goals met: 2 of 3
156. (go_north_east b1)
   changed: (x b1) from 41.5 to 43, (y b1) from 229.5 to 231
   goals met: 2 of 3
157. (go_north_east b1)
   changed: (x b1) from 43 to 44.5, (y b1) from 231 to 232.5
   goals met: 2 of 3
158. (go_north_east b1)
   changed: (x b1) from 44.5 to 46, (y b1) from 232.5 to 234
   goals met: 2 of 3
159. (go_north_east b1)
   changed: (x b1) from 46 to 47.5, (y b1) from 234 to 235.5
   goals met: 2 of 3
160. (go_north_east b1)
   changed: (x b1) from 47.5 to 49, (y b1) from 235.5 to 237
   goals met: 2 of 3
161. (go_north_east b1)
   changed: (x b1) from 49 to 50.5, (y b1) from 237 to 238.5
   goals met: 2 of 3
162. (go_north_east b1)
   changed: (x b1) from 50.5 to 52, (y b1) from 238.5 to 240
   goals met: 2 of 3
163. (go_north_east b1)
   changed: (x b1) from 52 to 53.5, (y b1) from 240 to 241.5
   goals met: 2 of 3
164. (go_north_east b1)
   changed: (x b1) from 53.5 to 55, (y b1) from 241.5 to 243
   goals met: 2 of 3
165. (go_north_east b1)
   changed: (x b1) from 55 to 56.5, (y b1) from 243 to 244.5
   goals met: 2 of 3
166. (go_north_east b1)
   changed: (x b1) from 56.5 to 58, (y b1) from 244.5 to 246
   goals met: 2 of 3
167. (go_north_east b1)
   changed: (x b1) from 58 to 59.5, (y b1) from 246 to 247.5
   goals met: 2 of 3
168. (go_north_east b1)
   changed: (x b1) from 59.5 to 61, (y b1) from 247.5 to 249
   goals met: 2 of 3
169. (go_north_east b1)
   changed: (x b1) from 61 to 62.5, (y b1) from 249 to 250.5
   goals met: 2 of 3
170. (go_north_east b1)
   changed: (x b1) from 62.5 to 64, (y b1) from 250.5 to 252
   goals met: 2 of 3
171. (go_north_east b1)
   changed: (x b1) from 64 to 65.5, (y b1) from 252 to 253.5
   goals met: 2 of 3
172. (go_north_east b1)
   changed: (x b1) from 65.5 to 67, (y b1) from 253.5 to 255
   goals met: 2 of 3
173. (go_north_east b1)
   changed: (x b1) from 67 to 68.5, (y b1) from 255 to 256.5
   goals met: 2 of 3
174. (go_north_east b1)
   changed: (x b1) from 68.5 to 70, (y b1) from 256.5 to 258
   goals met: 2 of 3
175. (go_north_west b1)
   changed: (x b1) from 70 to 68.5, (y b1) from 258 to 259.5
   goals met: 2 of 3
176. (go_north_west b1)
   changed: (x b1) from 68.5 to 67, (y b1) from 259.5 to 261
   goals met: 2 of 3
177. (go_north_west b1)
   changed: (x b1) from 67 to 65.5, (y b1) from 261 to 262.5
   goals met: 2 of 3
178. (go_north_west b1)
   changed: (x b1) from 65.5 to 64, (y b1) from 262.5 to 264
   goals met: 2 of 3
179. (go_north_west b1)
   changed: (x b1) from 64 to 62.5, (y b1) from 264 to 265.5
   goals met: 2 of 3
180. (go_north_west b1)
   changed: (x b1) from 62.5 to 61, (y b1) from 265.5 to 267
   goals met: 2 of 3
181. (go_north_west b1)
   changed: (x b1) from 61 to 59.5, (y b1) from 267 to 268.5
   goals met: 2 of 3
182. (go_north_west b1)
   changed: (x b1) from 59.5 to 58, (y b1) from 268.5 to 270
   goals met: 2 of 3
183. (go_north_west b1)
   changed: (x b1) from 58 to 56.5, (y b1) from 270 to 271.5
   goals met: 2 of 3
184. (go_north_west b1)
   changed: (x b1) from 56.5 to 55, (y b1) from 271.5 to 273
   goals met: 2 of 3
185. (go_north_west b1)
   changed: (x b1) from 55 to 53.5, (y b1) from 273 to 274.5
   goals met: 2 of 3
186. (go_north_west b1)
   changed: (x b1) from 53.5 to 52, (y b1) from 274.5 to 276
   goals met: 2 of 3
187. (go_north_west b1)
   changed: (x b1) from 52 to 50.5, (y b1) from 276 to 277.5
   goals met: 2 of 3
188. (go_north_west b1)
   changed: (x b1) from 50.5 to 49, (y b1) from 277.5 to 279
   goals met: 2 of 3
189. (go_north_west b1)
   changed: (x b1) from 49 to 47.5, (y b1) from 279 to 280.5
   goals met: 2 of 3
190. (go_north_west b1)
   changed: (x b1) from 47.5 to 46, (y b1) from 280.5 to 282
   goals met: 2 of 3
191. (go_north_west b1)
   changed: (x b1) from 46 to 44.5, (y b1) from 282 to 283.5
   goals met: 2 of 3
192. (go_north_west b1)
   changed: (x b1) from 44.5 to 43, (y b1) from 283.5 to 285
   goals met: 2 of 3
193. (go_north_west b1)
   changed: (x b1) from 43 to 41.5, (y b1) from 285 to 286.5
   goals met: 2 of 3
194. (go_north_west b1)
   changed: (x b1) from 41.5 to 40, (y b1) from 286.5 to 288
   goals met: 2 of 3
195. (go_north_west b1)
   changed: (x b1) from 40 to 38.5, (y b1) from 288 to 289.5
   goals met: 2 of 3
196. (go_north_west b1)
   changed: (x b1) from 38.5 to 37, (y b1) from 289.5 to 291
   goals met: 2 of 3
197. (go_north_west b1)
   changed: (x b1) from 37 to 35.5, (y b1) from 291 to 292.5
   goals met: 2 of 3
198. (go_north_west b1)
   changed: (x b1) from 35.5 to 34, (y b1) from 292.5 to 294
   goals met: 2 of 3
199. (go_north_west b1)
   changed: (x b1) from 34 to 32.5, (y b1) from 294 to 295.5
   goals met: 2 of 3
200. (go_north_west b1)
   changed: (x b1) from 32.5 to 31, (y b1) from 295.5 to 297
   goals met: 2 of 3
201. (go_north_west b1)
   changed: (x b1) from 31 to 29.5, (y b1) from 297 to 298.5
   goals met: 2 of 3
202. (go_north_west b1)
   changed: (x b1) from 29.5 to 28, (y b1) from 298.5 to 300
   goals met: 2 of 3
203. (go_north_west b1)
   changed: (x b1) from 28 to 26.5, (y b1) from 300 to 301.5
   goals met: 2 of 3
204. (go_north_west b1)
   changed: (x b1) from 26.5 to 25, (y b1) from 301.5 to 303
   goals met: 2 of 3
205. (go_north_west b1)
   changed: (x b1) from 25 to 23.5, (y b1) from 303 to 304.5
   goals met: 2 of 3
206. (go_north_west b1)
   changed: (x b1) from 23.5 to 22, (y b1) from 304.5 to 306
   goals met: 2 of 3
207. (go_north_west b1)
   changed: (x b1) from 22 to 20.5, (y b1) from 306 to 307.5
   goals met: 2 of 3
208. (go_north_west b1)
   changed: (x b1) from 20.5 to 19, (y b1) from 307.5 to 309
   goals met: 2 of 3
209. (go_north_west b1)
   changed: (x b1) from 19 to 17.5, (y b1) from 309 to 310.5
   goals met: 2 of 3
210. (go_north_west b1)
   changed: (x b1) from 17.5 to 16, (y b1) from 310.5 to 312
   goals met: 2 of 3
211. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 312 to 313.5
   goals met: 2 of 3
212. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 313.5 to 315
   goals met: 2 of 3
213. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 315 to 316.5
   goals met: 2 of 3
214. (go_north_west b1)
   changed: (x b1) from 11.5 to 10, (y b1) from 316.5 to 318
   goals met: 2 of 3
215. (go_north_west b1)
   changed: (x b1) from 10 to 8.5, (y b1) from 318 to 319.5
   goals met: 2 of 3
216. (go_north_west b1)
   changed: (x b1) from 8.5 to 7, (y b1) from 319.5 to 321
   goals met: 2 of 3
217. (go_north_west b1)
   changed: (x b1) from 7 to 5.5, (y b1) from 321 to 322.5
   goals met: 2 of 3
218. (go_north_west b1)
   changed: (x b1) from 5.5 to 4, (y b1) from 322.5 to 324
   goals met: 2 of 3
219. (go_north_west b1)
   changed: (x b1) from 4 to 2.5, (y b1) from 324 to 325.5
   goals met: 2 of 3
220. (go_north_west b1)
   changed: (x b1) from 2.5 to 1, (y b1) from 325.5 to 327
   goals met: 2 of 3
221. (save_person b1 p0)
   added: (saved p0)
   goals met: 3 of 3
